SunCity/src/Enums/ОсобенностиУчетаНоменклатуры/ОсобенностиУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОсобенностиУчетаНоменклатуры</name>
  <enumValues>
    <name>АлкогольнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>БезОсобенностейУчета</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>КиЗГИСМ</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ЛекарственныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ОбувнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияИзНатуральногоМеха</name>
  </enumValues>
  <enumValues>
    <name>ТабачнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>БАДы</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
  <enumValues>
    <name>СоковаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольноеПиво</name>
  </enumValues>
  <enumValues>
    <name>МорепродуктыПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МясоПодконтрольноеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ВетеринарныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ИгрыИИгрушкиДляДетей</name>
  </enumValues>
  <enumValues>
    <name>РадиоэлектроннаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ТитановаяМеталлопродукция</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>РастительныеМасла</name>
  </enumValues>
  <enumValues>
    <name>ОптоволокноИОптоволоконнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияБезВЕТИС</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ОсобенностиУчетаНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по типу номенклатуры
//
// Параметры:
//  ТипНоменклатуры	 - ПеречислениеСсылка.ТипыНоменклатуры
// 
// Возвращаемое значение:
//   Строка
//
Функция ПодсказкаПоОсобенностиУчетаНоменклатуры(ОсобенностьУчета) Экспорт
	
	//ИнтеграцияИСМПТК
	Если ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция Тогда
		Возврат НСтр("ru = 'Осуществляется учет по обороту маркируемой табачной продукции.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция Тогда
		Возврат НСтр("ru = 'Осуществляется учет по обороту маркируемой обувной продукции.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияПодконтрольнаяВЕТИС Тогда
		Возврат НСтр("ru = 'Осуществляется учет по обороту маркируемой молочной продукции.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ЛекарственныеПрепараты Тогда
		Возврат НСтр("ru = 'Осуществляется учет по обороту маркируемой лекарственной продукции.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность Тогда
		Возврат НСтр("ru = 'Осуществляется учет по обороту маркируемых товаров легкой промышленности и одежды.'");
	Иначе
		Возврат "";
	КонецЕсли;
	//Конец ИнтеграцияИСМПТК
	
	//Отключенный функционал
	Если ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция Тогда
		ТекстПодсказки = НСтр("ru = 'Формируются декларации по алкогольной продукции и осуществляется обмен с ЕГАИС информацией по обороту.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПодконтрольнаяПродукцияВЕТИС Тогда
		ТекстПодсказки = НСтр("ru='Осуществляется обмен с ВетИС информацией по обороту продукции животного происхождения.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПродукцияИзНатуральногоМеха Тогда
		Если ИнтеграцияГИСМ.ПодсистемаНеИспользуется() Тогда
			ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту товаров из натурального меха.'");
		Иначе
			ТекстПодсказки = НСтр("ru = 'Продукция маркируется специальными контрольными идентификационными знаками (КиЗ) и осуществляется обмен с ГИСМ (информационной системой маркировки товаров) информацией по обороту.'");
		КонецЕсли;
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.КиЗГИСМ Тогда
		Если ИнтеграцияГИСМ.ПодсистемаНеИспользуется() Тогда
			ТекстПодсказки = НСтр("ru = 'Не используется. Контрольные идентификационные знаки (КИЗ), которыми маркируется продукция, учитываемая в ГИСМ (информационной системе маркировки товаров).'");
		Иначе
			ТекстПодсказки = НСтр("ru = 'Контрольные идентификационные знаки (КИЗ), которыми маркируется продукция, учитываемая в ГИСМ (информационной системе маркировки товаров).'");
		КонецЕсли;
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МОТП информацией по обороту табачной продукции.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту обувной продукции.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту товаров легкой промышленности и одежды.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияПодконтрольнаяВЕТИС Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП и ВетИС информацией по обороту молока и молочной продукции.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияБезВЕТИС Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту молока и молочной продукции.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Шины Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту шин и автопокрышек.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Фотоаппараты Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту фотоаппаратов и ламп-вспышек.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Велосипеды Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту велосипедов и велосипедных рам.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.КреслаКоляски Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту медицинских изделий.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Духи Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту духов и туалетной воды.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.АльтернативныйТабак Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту альтернативного табака.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.УпакованнаяВода Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту упакованной воды.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Антисептики Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту антисептиков.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.БАДы Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту биологически активных добавок.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.НикотиносодержащаяПродукция Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту никотиносодержащей продукции.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Пиво Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП и ЕГАИС информацией по обороту пива.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.СоковаяПродукция Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту соковой продукции.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.БезалкогольноеПиво Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту безалкогольного пива.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.МорепродуктыПодконтрольныеВЕТИС Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП и ВетИС информацией по обороту морепродуктами.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.КормаДляЖивотныхПодконтрольныеВЕТИС Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП и ВетИС информацией по обороту кормов для животных.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.КормаДляЖивотныхБезВЕТИС Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту кормов для животных (без ВетИС).'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.МясоПодконтрольноеВЕТИС Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП и ВетИС информацией по обороту мясом.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ВетеринарныеПрепараты Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту ветеринарными препаратами.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ИгрыИИгрушкиДляДетей Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту играми и игрушками для детей.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.РадиоэлектроннаяПродукция Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту радиоэлектронной продукцией.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ТитановаяМеталлопродукция Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту титановой металлопродукцией.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.КонсервированнаяПродукцияПодконтрольнаяВЕТИС Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП и ВетИС информацией по обороту консервированной продукцией.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.КонсервированнаяПродукцияБезВЕТИС Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту консервированной продукцией (без ВетИС).'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.РастительныеМасла Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту растительных масел.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОптоволокноИОптоволоконнаяПродукция Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту оптоволокном и оптоволоконной продукцией.'");
	ИначеЕсли ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия Тогда
		ТекстПодсказки = НСтр("ru = 'Осуществляется обмен с ИС МП информацией по обороту парфюмерных и косметических средств и бытовой химии.'");
	КонецЕсли;
	
	Возврат ТекстПодсказки;
	
КонецФункции

// Связь особенностей учета и функциональных опций. Если связь не указана, то особенность учета по умолчанию скрывается.
//
// Возвращаемое значение:
//	Соответствие: Ключ - ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры.
//					Значение - Строка - имена функциональных опций через запятую, значения опций объединяются по И.
//
Функция СвязьОсобенностейУчетаИФО() Экспорт
	
	СвязьОсобенностейУчетаИФО = Новый Соответствие;
	
	//ИнтеграцияИСМПТК
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция, 	 "ВестиУчетМаркируемогоТабакаИСМПТК");
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция, 		 "ВестиУчетМаркируемойОбувиИСМПТК");
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ЛекарственныеПрепараты, "ВестиУчетМаркируемыхЛекарствИСМПТК");
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность, 	 "ВестиУчетМаркируемогоТекстиляИСМПТК");
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияПодконтрольнаяВЕТИС, "ВестиУчетМаркируемойМолочкиИСМПТК");
	
	Возврат СвязьОсобенностейУчетаИФО;
	//Конец ИнтеграцияИСМПТК
		
	//Отключенный функционал
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция, "ВестиСведенияДляДекларацийПоАлкогольнойПродукции");
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.Пиво, "ВестиСведенияДляДекларацийПоАлкогольнойПродукции");
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ПодконтрольнаяПродукцияВЕТИС, "ВестиУчетПодконтрольныхТоваровВЕТИС");
	СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияПодконтрольнаяВЕТИС, "ВестиУчетПодконтрольныхТоваровВЕТИС");
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидПродукции КАК ВидПродукции
		|ИЗ
		|	РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП
		|ГДЕ
		|	ВестиУчетПродукции";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОсобенностьУчета = ИнтеграцияИСРТКлиентСервер.ОсобенностьУчетаПоВидуПродукции(Выборка.ВидПродукции);
			Если ЗначениеЗаполнено(ОсобенностьУчета) Тогда
				СвязьОсобенностейУчетаИФО.Вставить(ОсобенностьУчета, "ВестиУчетМаркируемойПродукцииИСМП");
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ИнтеграцияГИСМ.ПодсистемаНеИспользуется() Тогда
		Если СвязьОсобенностейУчетаИФО[Перечисления.ОсобенностиУчетаНоменклатуры.ПродукцияИзНатуральногоМеха] <> Неопределено Тогда
			СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ПродукцияИзНатуральногоМеха, "ВестиУчетМаркируемойПродукцииИСМП");
			СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.КиЗГИСМ,                     "ВестиУчетМаркируемойПродукцииИСМП");
		КонецЕсли;
	Иначе
		СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.ПродукцияИзНатуральногоМеха, "ВестиУчетМаркировкиПродукцииВГИСМ");
		СвязьОсобенностейУчетаИФО.Вставить(Перечисления.ОсобенностиУчетаНоменклатуры.КиЗГИСМ,                     "ВестиУчетМаркировкиПродукцииВГИСМ");
	КонецЕсли;
	
	Возврат СвязьОсобенностейУчетаИФО;
	
КонецФункции

#КонецОбласти

#КонецЕсли
